# Test the DevTed-Package

# Import

In [15]:
import devted as dt
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

from typing import *
from devted.typing import *
from pandas import DataFrame, Series

In [16]:
BASE = "title xlabel ylabel set_kwargs"
ORIENT = f"{BASE} orient"

In [17]:
df_ts = pd.read_csv("./data/ts_data.csv")
df_ts["Date"] = pd.to_datetime(df_ts["Date"])
df_ts

,Date,Open,High,Low,Close,Adj Close,Volume
0,2021-11-30,159.990005,165.520004,159.919998,165.300003,164.346161,174048100
1,2021-12-01,167.479996,170.300003,164.529999,164.770004,163.819229,152052500
2,2021-12-02,158.740005,164.199997,157.800003,163.759995,162.815048,136739200
3,2021-12-03,164.020004,164.960007,159.720001,161.839996,160.906128,118023100
4,2021-12-06,164.289993,167.880005,164.279999,165.320007,164.366058,107497000
...,...,...,...,...,...,...,...
247,2022-11-22,148.130005,150.419998,146.929993,150.179993,150.179993,51804100
248,2022-11-23,149.449997,151.830002,149.339996,151.070007,151.070007,58301400
249,2022-11-25,148.309998,148.880005,147.119995,148.110001,148.110001,35195900
250,2022-11-28,145.139999,146.639999,143.380005,144.220001,144.220001,69246000
251,2022-11-29,144.289993,144.809998,140.350006,141.169998,141.169998,83679400

In [18]:
df = pd.read_csv("./data/titanic.csv")
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [19]:
d = {"hi": "hey", "ignore": "me"}
{k: v for k, v in d.items() if k not in ["ignore"]}

{'hi': 'hey'}

In [20]:
def zipparams(ignore: Vector = None):
    def decorator(func):
        def wrapper(*args, **kwargs):
            zip_params = {k: v for k, v in kwargs.items() if k not in ignore}
            return func(zip_params=zip_params, **kwargs)
        return wrapper
    return decorator

In [21]:
tdf = DataFrame(
    {
        "column 1": [1],
        "column-1": [1],
        "column_1": [1],
        "column.*+#1,;<>?!Â§$%&/()=?": [1],
        "column.*+#1,;<>?!Â§$%&/()=?": [1],
        "columnNameMyBeauty": [1],
    }
)

In [22]:


v = "column.*+#1,;<>?!Â§$%&/()=?"
vs = ". * + # , ; < > ? ! Â§ $ % & / ( ) = ?".split()
for replace_value in vs:
    v = v.replace(replace_value, "_")

while v.find("__") != -1:
    v = v.replace("__", "_")
    print(v)

v = v.upper()
if v[-1] == "_": v = v[:-1]
print(v)

column__1________
column_1____
column_1__
column_1_
COLUMN_1

In [23]:
for col in tdf.columns:
    print(col)

column 1
column-1
column_1
column.*+#1,;<>?!Â§$%&/()=?
columnNameMyBeauty

In [24]:
import devted as dt

dt.print_df_columns_for_constants(tdf)

DFC_COLUMN_1 = "column 1"
DFC_COLUMN_1 = "column-1"
DFC_COLUMN_1 = "column_1"
DFC_COLUMN_1 = "column.*+#1,;<>?!Â§$%&/()=?"
DFC_COLUMN_NAME_MY_BEAUTY = "columnNameMyBeauty"

In [25]:
s = "besserAlsDuHeheHEHE"

insert_at = []
for i in range(1, len(s)):
    if s[i].isupper() and s[i - 1].islower():
        print(s[i-1], s[i])
        insert_at.append(i)


insert_at

r A
s D
u H
e H

[6, 9, 11, 15]

In [26]:
s = "besserAlsDuHeheHEHE"

for i in range(len(s) - 1, 0, -1):
    if s[i].isupper() and s[i - 1].islower():
        s = f"{s[:i]}_{s[i:]}"
s.upper()

'BESSER_ALS_DU_HEHE_HEHE'